{
  "transform_params" : {
    "image" : {
      "bias_a" : 0,
      "bias_g" : 0,
      "bias_r" : 0,
      "bias_b" : 0,
      "center_mean" : 0,
      "is_network_bgr" : 0,
      "scale" : 1
    }
  },
  "properties" : {

  },
  "analyses" : {

  },
  "format_version" : 200,
  "storage" : "model.espresso.weights",
  "layers" : [
    {
      "bottom" : "image",
      "alpha" : 0.39152181148529053,
      "operation" : 3,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "",
      "top" : "image__fix__underflow_____transformer_encode_1_conv",
      "type" : "elementwise",
      "name" : "transformer_encode_1_conv__fix__underflow___",
      "beta" : 0
    },
    {
      "pad_r" : 4,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "",
      "pad_fill_mode" : 0,
      "pad_b" : 4,
      "pad_l" : 4,
      "top" : "transformer_activation0",
      "blob_weights" : 3,
      "K" : 3,
      "blob_biases" : 1,
      "name" : "transformer_encode_1_conv",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 4,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "image__fix__underflow_____transformer_encode_1_conv",
      "weights" : {

      },
      "Nx" : 9,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 9,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "transformer_encode_2_conv",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "transformer_activation1",
      "blob_weights" : 7,
      "K" : 32,
      "blob_biases" : 5,
      "stride_x" : 2,
      "name" : "transformer_encode_2_conv",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "transformer_activation0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "transformer_encode_3_conv",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "transformer_activation2",
      "blob_weights" : 11,
      "K" : 32,
      "blob_biases" : 9,
      "stride_x" : 2,
      "name" : "transformer_encode_3_conv",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "transformer_activation1",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "transformer_residual_1_conv_1",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "transformer_residualblock0_activation0",
      "blob_weights" : 15,
      "K" : 32,
      "blob_biases" : 13,
      "name" : "transformer_residual_1_conv_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "transformer_activation2",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "transformer_residual_1_conv_2",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "transformer_residualblock0_instancenorm1__fwd",
      "blob_weights" : 19,
      "K" : 32,
      "blob_biases" : 17,
      "name" : "transformer_residual_1_conv_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "transformer_residualblock0_activation0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "transformer_residualblock0_instancenorm1__fwd,transformer_activation2",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "transformer_residualblock0__plus0",
      "top" : "transformer_residualblock0__plus0",
      "type" : "elementwise",
      "name" : "transformer_residualblock0__plus0",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "transformer_residual_2_conv_1",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "transformer_residualblock1_activation0",
      "blob_weights" : 23,
      "K" : 32,
      "blob_biases" : 21,
      "name" : "transformer_residual_2_conv_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "transformer_residualblock0__plus0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "transformer_residual_2_conv_2",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "transformer_residualblock1_instancenorm1__fwd",
      "blob_weights" : 27,
      "K" : 32,
      "blob_biases" : 25,
      "name" : "transformer_residual_2_conv_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "transformer_residualblock1_activation0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "transformer_residualblock0__plus0,transformer_residualblock1_instancenorm1__fwd",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "transformer_residualblock1__plus0",
      "top" : "transformer_residualblock1__plus0",
      "type" : "elementwise",
      "name" : "transformer_residualblock1__plus0",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "transformer_residual_3_conv_1",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "transformer_residualblock2_activation0",
      "blob_weights" : 31,
      "K" : 32,
      "blob_biases" : 29,
      "name" : "transformer_residual_3_conv_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "transformer_residualblock1__plus0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "transformer_residual_3_conv_2",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "transformer_residualblock2_instancenorm1__fwd",
      "blob_weights" : 35,
      "K" : 32,
      "blob_biases" : 33,
      "name" : "transformer_residual_3_conv_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "transformer_residualblock2_activation0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "transformer_residualblock1__plus0,transformer_residualblock2_instancenorm1__fwd",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "transformer_residualblock2__plus0",
      "top" : "transformer_residualblock2__plus0",
      "type" : "elementwise",
      "name" : "transformer_residualblock2__plus0",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "transformer_residual_4_conv_1",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "transformer_residualblock3_activation0",
      "blob_weights" : 39,
      "K" : 32,
      "blob_biases" : 37,
      "name" : "transformer_residual_4_conv_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "transformer_residualblock2__plus0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "transformer_residual_4_conv_2",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "transformer_residualblock3_instancenorm1__fwd",
      "blob_weights" : 43,
      "K" : 32,
      "blob_biases" : 41,
      "name" : "transformer_residual_4_conv_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "transformer_residualblock3_activation0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "transformer_residualblock2__plus0,transformer_residualblock3_instancenorm1__fwd",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "transformer_residualblock3__plus0",
      "top" : "transformer_residualblock3__plus0",
      "type" : "elementwise",
      "name" : "transformer_residualblock3__plus0",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "transformer_residual_5_conv_1",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "transformer_residualblock4_activation0",
      "blob_weights" : 47,
      "K" : 32,
      "blob_biases" : 45,
      "name" : "transformer_residual_5_conv_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "transformer_residualblock3__plus0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "transformer_residual_5_conv_2",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "transformer_residualblock4_instancenorm1__fwd",
      "blob_weights" : 51,
      "K" : 32,
      "blob_biases" : 49,
      "name" : "transformer_residual_5_conv_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "transformer_residualblock4_activation0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "transformer_residualblock3__plus0,transformer_residualblock4_instancenorm1__fwd",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "transformer_residualblock4__plus0",
      "top" : "transformer_residualblock4__plus0",
      "type" : "elementwise",
      "name" : "transformer_residualblock4__plus0",
      "beta" : 0
    },
    {
      "top" : "transformer_upsampling0",
      "use_fractional_scale_factors" : false,
      "weights" : {

      },
      "fractional_scaling_factor_y" : 1,
      "type" : "upsample",
      "scaling_factor_x" : 2,
      "mode" : 0,
      "align_corners" : 0,
      "bottom" : "transformer_residualblock4__plus0",
      "debug_info" : "transformer_upsampling0",
      "fractional_scaling_factor_x" : 1,
      "is_legacy_mode" : 1,
      "name" : "transformer_upsampling0",
      "scaling_factor_y" : 2
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "transformer_decoding_1_conv",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "transformer_activation3",
      "blob_weights" : 55,
      "K" : 32,
      "blob_biases" : 53,
      "name" : "transformer_decoding_1_conv",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "transformer_upsampling0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "top" : "transformer_upsampling1",
      "use_fractional_scale_factors" : false,
      "weights" : {

      },
      "fractional_scaling_factor_y" : 1,
      "type" : "upsample",
      "scaling_factor_x" : 2,
      "mode" : 0,
      "align_corners" : 0,
      "bottom" : "transformer_activation3",
      "debug_info" : "transformer_upsampling1",
      "fractional_scaling_factor_x" : 1,
      "is_legacy_mode" : 1,
      "name" : "transformer_upsampling1",
      "scaling_factor_y" : 2
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "transformer_decoding_2_conv",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "transformer_activation4",
      "blob_weights" : 59,
      "K" : 32,
      "blob_biases" : 57,
      "name" : "transformer_decoding_2_conv",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "transformer_upsampling1",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 4,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "transformer_conv5",
      "pad_fill_mode" : 0,
      "pad_b" : 4,
      "pad_l" : 4,
      "top" : "transformer_conv5_fwd",
      "blob_weights" : 63,
      "K" : 32,
      "blob_biases" : 61,
      "name" : "transformer_conv5",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 4,
      "has_biases" : 1,
      "C" : 3,
      "bottom" : "transformer_activation4",
      "weights" : {

      },
      "Nx" : 9,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 9,
      "n_parallel" : 1
    },
    {
      "bottom" : "transformer_conv5_fwd",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "transformer_activation5",
      "top" : "transformer_activation5",
      "type" : "activation",
      "name" : "transformer_activation5"
    },
    {
      "bottom" : "",
      "k" : 3,
      "n" : 1,
      "weights" : {

      },
      "h" : 1,
      "debug_info" : "transformer__mulscalar0_output",
      "constant_blob" : 65,
      "top" : "transformer__mulscalar0_output_constant_in_scale",
      "w" : 1,
      "type" : "load_constant",
      "name" : "transformer__mulscalar0_output_constant_in_scale"
    },
    {
      "bottom" : "",
      "k" : 3,
      "n" : 1,
      "weights" : {

      },
      "h" : 1,
      "debug_info" : "transformer__mulscalar0_output",
      "constant_blob" : 67,
      "top" : "transformer__mulscalar0_output_constant_in_bias",
      "w" : 1,
      "type" : "load_constant",
      "name" : "transformer__mulscalar0_output_constant_in_bias"
    },
    {
      "bottom" : "transformer_activation5,transformer__mulscalar0_output_constant_in_scale",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "transformer__mulscalar0_output",
      "top" : "transformer__mulscalar0_output_mul_out",
      "type" : "elementwise",
      "name" : "transformer__mulscalar0_output_mul_out",
      "beta" : 0
    },
    {
      "bottom" : "transformer__mulscalar0_output_mul_out,transformer__mulscalar0_output_constant_in_bias",
      "alpha" : 1,
      "operation" : 0,
      "beta" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "transformer__mulscalar0_output",
      "top" : "stylizedImage",
      "type" : "elementwise",
      "name" : "transformer__mulscalar0_output",
      "attributes" : {
        "is_output" : 1
      }
    }
  ]
}